app/controllers/accounts_controller.rb

SELECT * FROM `accounts`
---
  def index
    @accounts = Account.all

SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)
---
  def show
    @account = Account.find(params[:id])

INSERT INTO `accounts` (`name`, `created_at`, `updated_at`, `user_id`) VALUES('American Express', '2010-02-03 06:18:25', '2010-02-03 06:18:25', 1)
---
  def create
    @account = Account.new(params[:account])

    respond_to do |format|
      if @account.save